// Написать программу вычисления произведения чисел от 1 до N

long F=1;
for (int N=1; N <30; N++)
{
    F=1;}
{
    
}
for (int i = 0; i <=N; i++)
{
    F=F*i;
}
Console.WriteLine("F=" +F);