// 5. Написать программу вычисления значения функции y=f(a)

double Function (double x)
{
    return x*x;
}

Console.WriteLine(Function(3));
